triggery/STM32F4_GIF/LCD/SSD1289.c
#include "SSD1289.h"
#include "stm32f4xx_rcc.h"
#include "stm32f4xx_gpio.h"
#include "stm32f4xx_fsmc.h"
#include "stm32f4xx_tim.h"
#include "delay.h"
#include "my_str_lib.h"

#define LCD_REG      (*((volatile unsigned short *) 0x60000000)) 
#define LCD_RAM      (*((volatile unsigned short *) 0x60020000)) 

#define MAX_POLY_CORNERS   200
#define POLY_Y(Z)          ((int32_t)((Points + Z)->X))
#define POLY_X(Z)          ((int32_t)((Points + Z)->Y))
#define ABS(X)  ((X) > 0 ? (X) : -(X))     

uint16_t getColor565(uint8_t R, uint8_t G, uint8_t B)
{
	return (uint16_t)( ((R << 8) & 0xF800) | ((G << 3) & 0x7E0) | ((B >> 3) & 0x1F) );
}

#define Y_offset 10
uint16_t Y_text;
uint8_t MAX_char = 20;

void setMaxChar(uint8_t numOfChars) {
  MAX_char = numOfChars;
}

uint8_t getMaxChars(void) {
  return MAX_char;
}

/* Global variables to set the written text color */
__IO uint16_t TextColor = 0x0000;
__IO uint16_t BackColor = 0xFFFF;
/* 8x8=8 12x12=12 8x16=16 12x12=14 16x24=24 */
__IO uint16_t asciisize = 16;
//****************************************************************************//
uint16_t TimerPeriod    = 0;
uint16_t Channel3Pulse  = 0;
//****************************************************************************//
static void LCD_PolyLineRelativeClosed(pPoint Points, uint16_t PointCount, uint16_t Closed);
//****************************************************************************//
TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
TIM_OCInitTypeDef  TIM_OCInitStructure;
//****************************************************************************//
uint16_t BMP_FormatData = BMP_FORMAT_LE;

void SetBMPFormatData(FORMAT_BMP format)
{
  BMP_FormatData = format;
}
/**
 * bytes change places
 */
uint16_t _bytes_change(uint16_t pixel)
{
	uint16_t RGB = pixel;
	return (RGB >> 8) | (RGB << 8) ;
}

/*
 * This initialization function TFT display SSD1289 controller
 */
void LCD_Init(void)
{ 
  LCD_CtrlLinesConfig();

  LCD_FSMCConfig();

  TIM_Config();
  LCD_BackLight(50);
  
  Delay(50);

  LCD_WriteReg(0x0007,0x0021);
  LCD_WriteReg(0x0000,0x0001);
  LCD_WriteReg(0x0007,0x0023);
  LCD_WriteReg(0x0010,0x0000);
  LCD_WriteReg(0x0007,0x0033);
  LCD_WriteReg(0x0011,0x6830); // Entry Mode (R11h) : POR = 0x6830
  LCD_WriteReg(0x0002,0x0600);
  LCD_WriteReg(0x0012,0x6CEB);
  LCD_WriteReg(0x0003,0xA8A4);
  LCD_WriteReg(0x000C,0x0000);
  LCD_WriteReg(0x000D,0x080C);
  LCD_WriteReg(0x000E,0x2B00);
  LCD_WriteReg(0x001E,0x00B0);
  LCD_WriteReg(0x0001,0x2b3F); //RGB
  LCD_WriteReg(0x0005,0x0000);
  LCD_WriteReg(0x0006,0x0000);
  LCD_WriteReg(0x0016,0xEF1C);
  LCD_WriteReg(0x0017,0x0103);
  LCD_WriteReg(0x000B,0x0000);
  LCD_WriteReg(0x000F,0x0000);
  LCD_WriteReg(0x0041,0x0000);
  LCD_WriteReg(0x0042,0x0000);
  LCD_WriteReg(0x0048,0x0000);
  LCD_WriteReg(0x0049,0x013F);
  LCD_WriteReg(0x004A,0x0000);
  LCD_WriteReg(0x004B,0x0000);
  LCD_WriteReg(0x0044,0xEF00); // Horizontal RAM address position (R44h) (POR = EF00h)
  LCD_WriteReg(0x0045,0x0000); // Vertical RAM address position (R45h) : start positions of the window address
  LCD_WriteReg(0x0046,0x013F); // Vertical RAM address position (R46h) : end positions of the window address
  LCD_WriteReg(0x0030,0x0707);
  LCD_WriteReg(0x0031,0x0204);
  LCD_WriteReg(0x0032,0x0204);
  LCD_WriteReg(0x0033,0x0502);
  LCD_WriteReg(0x0034,0x0507);
  LCD_WriteReg(0x0035,0x0204);
  LCD_WriteReg(0x0036,0x0204);
  LCD_WriteReg(0x0037,0x0502);
  LCD_WriteReg(0x003A,0x0302);
  LCD_WriteReg(0x002F,0x12BE);
  LCD_WriteReg(0x003B,0x0302);
  LCD_WriteReg(0x0023,0x0000);
  LCD_WriteReg(0x0024,0x0000);
  LCD_WriteReg(0x0025,0x8000);
  LCD_WriteReg(0x004f,0x0000);
  LCD_WriteReg(0x004e,0x0000);
  Y_text = Y_offset;
}

void LCD_WriteRAM_Prepare(void)
{
  LCD_REG = LCD_REG_34;
}

void LCD_WriteRAM(uint16_t RGB_Code)
{
  LCD_RAM = RGB_Code;
}

void LCD_WriteReg(uint8_t LCD_Reg, uint16_t LCD_RegValue)
{
  LCD_REG = LCD_Reg;
  LCD_RAM = LCD_RegValue;
}

void LCD_DisplayOn(void)
{
  LCD_WriteReg(LCD_REG_7, 0x0173); 
}

void LCD_DisplayOff(void)
{
  LCD_WriteReg(LCD_REG_7, 0x0000); 
}

void LCD_SetColors(__IO uint16_t _TextColor, __IO uint16_t _BackColor)
{
  TextColor = _TextColor; 
  BackColor = _BackColor;
}

void LCD_GetColors(__IO uint16_t *_TextColor, __IO uint16_t *_BackColor)
{
  *_TextColor = TextColor; *_BackColor = BackColor;
}

void LCD_SetTextColor(__IO uint16_t Color)
{
  TextColor = Color;
}

void LCD_SetBackColor(__IO uint16_t Color)
{
  BackColor = Color;
}

/* 8x8=8 12x12=12 8x16=16 12x12=14 16x24=24 */
void LCD_CharSize(__IO uint16_t size)
{
	asciisize= size;
}

__IO uint16_t LCD_GetCharSize(void)
{
	return asciisize;
}

__IO uint16_t LCD_TextColor(void)
{
	return TextColor;
}

__IO uint16_t LCD_BackColor(void)
{
	return BackColor;
}
void LCD_Clear(uint16_t Color)
{
  //------------------------------------------
  LCD_WriteReg(0x0044,0xEF00); // Horizontal RAM address position (R44h) (POR = EF00h)
  LCD_WriteReg(0x0045,0x0000); // Vertical RAM address position (R45h) : start positions of the window address
  LCD_WriteReg(0x0046,0x013F);
  LCD_WriteReg(0x004f,0x0000);
  LCD_WriteReg(0x004e,0x0000);
  //------------------------------------------

  uint32_t index = 0;
  LCD_SetCursor(0x00, 0x00);
  LCD_WriteRAM_Prepare();
  for(index = 0; index <76800; index++)
  {
    LCD_RAM = Color;
  }  
}

void LCD_SetCursor(uint16_t Xpos, uint16_t Ypos)
{
  LCD_WriteReg(LCD_REG_78, Xpos);
  LCD_WriteReg(LCD_REG_79, Ypos);
}

void PutPixel(int16_t x, int16_t y)
{ 
	if (( x > 239 )||( y > 319 )) return;
	LCD_SetCursor(x, y);
	LCD_WriteRAM_Prepare();
	LCD_WriteRAM(TextColor);
}

void Pixel(int16_t x, int16_t y,int16_t c)
{ 
        if (( x > 239 )||( y > 319 )) return;
	LCD_SetCursor(x,y);
	LCD_WriteRAM_Prepare();
	LCD_WriteRAM(c);
}

void LCD_PutChar(int16_t PosX, int16_t PosY, char c) 
{
  uint8_t i = 0;
  uint8_t j = 0;

  //----------------------------------------------------------------------------
  if(asciisize==8)
  {
  uint8_t  Buffer[8];
  uint8_t TmpChar = 0;
  
    GetASCIICode1(Buffer,c);
	for (i=0;i<8;i++)
	{
		TmpChar = Buffer[i];
		for (j=0;j<8;j++)
		{
			if ( ((TmpChar >> (7-j)) & 0x01) == 0x01)
			{
                          Pixel(PosX +j, PosY + i, TextColor); 
			}
			else
			{
			Pixel(PosX + j, PosY + i, BackColor);
			}
		}
	}
  }
  //----------------------------------------------------------------------------
    if(asciisize==12)
  {
  uint8_t Buffer[12];
  uint8_t TmpChar = 0;
  
    GetASCIICode2(Buffer,c);
	for (i=0;i<12;i++)
	{
		TmpChar = Buffer[i];
		for (j=0;j<8;j++)
		{
			if ( ((TmpChar >> (7-j)) & 0x01) == 0x01)
			{
                          Pixel(PosX +j, PosY + i, TextColor); 
			}
			else
			{
			Pixel(PosX + j, PosY + i, BackColor);
			}
		}
	}
  }
  //----------------------------------------------------------------------------
    if(asciisize==16)
  {
  unsigned char Buffer[16];
  uint8_t TmpChar = 0;
  
    GetASCIICode4(Buffer,c);
	for (i=0;i<16;i++)
	{
		TmpChar = Buffer[i];
		for (j=0;j<8;j++)
		{
			if ( ((TmpChar >> (7-j)) & 0x01) == 0x01)
			{
                          Pixel(PosX +j, PosY + i, TextColor); 
			}
			else
			{
			Pixel(PosX + j, PosY + i, BackColor);
			}
		}
	}
  }
  //----------------------------------------------------------------------------
      if(asciisize==14)
  {
  short int  Buffer[12];
  uint16_t TmpChar = 0;
  
    GetASCIICode3(Buffer,c);
	for (i=0;i<12;i++)
	{
		TmpChar = Buffer[i];
		for (j=0;j<12;j++)
		{
                        if ( ((TmpChar >> j ) & (0x01)) == 0x01)
			{
                          Pixel(PosX +j, PosY + i, TextColor); 
			}
			else
			{
			Pixel(PosX + j, PosY + i, BackColor);
			}
		}
	}
  }
  //----------------------------------------------------------------------------
      if(asciisize==24)
  {
  short int  Buffer[24];
  uint16_t TmpChar = 0;
    GetASCIICode5(Buffer,c);
	for (i=0;i<24;i++)
	{
		TmpChar = Buffer[i];
		for (j=0;j<16;j++)
		{
			if (( (TmpChar >>j)&(0x01)) == 0x01)
			{
                          Pixel(PosX +j, PosY + i, TextColor); 
			}
			else
			{
			Pixel(PosX + j, PosY + i, BackColor);
			}
		}
	}
  }
  //----------------------------------------------------------------------------
}

