triggery/STM32F4_GIF/LCD/SSD1289.c
  /*  Loop through the rows of the image. */
  for (pixelY = IMAGE_TOP; pixelY < IMAGE_BOTTOM; pixelY++) 
  {  
    /* Build a list of nodes. */
    nodes = 0; j = PointCount-1;

    for (i = 0; i < PointCount; i++) 
    {
      if (((POLY_Y(i)<(double) pixelY) && (POLY_Y(j)>=(double) pixelY)) || \
          ((POLY_Y(j)<(double) pixelY) && (POLY_Y(i)>=(double) pixelY)))
      {
        nodeX[nodes++]=(int) (POLY_X(i)+((pixelY-POLY_Y(i))*(POLY_X(j)-POLY_X(i)))/(POLY_Y(j)-POLY_Y(i))); 
      }
      j = i; 
    }
  
    /* Sort the nodes, via a simple "Bubble" sort. */
    i = 0;
    while (i < nodes-1) 
    {
      if (nodeX[i]>nodeX[i+1]) 
      {
        swap = nodeX[i]; 
        nodeX[i] = nodeX[i+1]; 
        nodeX[i+1] = swap; 
        if(i)
        {
          i--; 
        }
      }
      else 
      {
        i++;
      }
    }
  
    /*  Fill the pixels between node pairs. */
    for (i = 0; i < nodes; i+=2) 
    {
      if(nodeX[i] >= IMAGE_RIGHT) 
      {
        break;
      }
      if(nodeX[i+1] > IMAGE_LEFT) 
      {
        if (nodeX[i] < IMAGE_LEFT)
        {
          nodeX[i]=IMAGE_LEFT;
        }
        if(nodeX[i+1] > IMAGE_RIGHT)
        {
          nodeX[i+1] = IMAGE_RIGHT;
        }
        LCD_SetTextColor(BackColor);
        LCD_DrawLine(pixelY, nodeX[i+1], nodeX[i+1] - nodeX[i], LCD_DIR_HORIZONTAL);
        LCD_SetTextColor(TextColor);
        PutPixel(pixelY, nodeX[i+1]);
        PutPixel(pixelY, nodeX[i]);
        /* for (j=nodeX[i]; j<nodeX[i+1]; j++) PutPixel(j,pixelY); */
      }
    }
  } 

  /* draw the edges */
  LCD_SetTextColor(TextColor);
}



void LCD_BackLight(int procentai)
{
  if (procentai>100)
    {procentai=100;}
  else if(procentai<0)
    {procentai=0;}
  Channel3Pulse =(uint16_t)(((uint32_t)procentai*(TimerPeriod-1))/100);
  TIM_TimeBaseStructure.TIM_Period = TimerPeriod;
  TIM_OCInitStructure.TIM_Pulse = Channel3Pulse;
  TIM_OC3Init(TIM1, &TIM_OCInitStructure);
}

void TIM_Config(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  RCC_AHB1PeriphClockCmd( RCC_AHB1Periph_GPIOA  , ENABLE);
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP ;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource10, GPIO_AF_TIM1);
  TimerPeriod = (SystemCoreClock / 17570 ) - 1;		// 17570 kHz
  Channel3Pulse = (uint16_t) (((uint32_t) 99 * (TimerPeriod - 1)) / 100);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1 , ENABLE);
  TIM_TimeBaseStructure.TIM_Prescaler = 0;
  TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  TIM_TimeBaseStructure.TIM_Period = TimerPeriod;
  TIM_TimeBaseStructure.TIM_ClockDivision = 0;
  TIM_TimeBaseStructure.TIM_RepetitionCounter = 0;
  TIM_TimeBaseInit(TIM1, &TIM_TimeBaseStructure);
  TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM2;
  TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
  TIM_OCInitStructure.TIM_OutputNState = TIM_OutputNState_Enable;
  TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_Low;
  TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCNPolarity_High;
  TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Set;
  TIM_OCInitStructure.TIM_OCNIdleState = TIM_OCIdleState_Reset;
  TIM_OCInitStructure.TIM_Pulse = Channel3Pulse;
  TIM_OC3Init(TIM1, &TIM_OCInitStructure);
  TIM_Cmd(TIM1, ENABLE);
  TIM_CtrlPWMOutputs(TIM1, ENABLE);
        
}

void LCD_SetDisplayWindow(uint16_t Xpos, uint16_t Ypos, uint16_t Height, uint16_t Width)
{
  if(Xpos >= Height)
  {
    LCD_WriteReg(0x0044, (Xpos - Height +1));
  }
  else
  {
    LCD_WriteReg(0x0044, 0x0000);
  }
  if(Ypos >= Width)
  {
    LCD_WriteReg(0x0045, (Ypos - Width +1));
  }  
  else
  {
    LCD_WriteReg(0x0045, 0x0000);
  }
  LCD_WriteReg(0x0046, Ypos);
  LCD_SetCursor(Xpos, Ypos);
}

/*void LCD_WriteBMP(uint16_t Xpos, uint16_t Ypos, uint16_t Height, uint16_t Width, uint8_t *bitmap)
{
  volatile uint32_t index;
  uint16_t *bitmap_ptr = (uint16_t *)bitmap;
  uint32_t size;
  size=(Height * Width);

  LCD_WriteReg(LCD_REG_17, 0x6048);
  LCD_SetDisplayWindow(Xpos, Ypos,Height, Width);

  LCD_WriteRAM_Prepare();
 
  for(index = 0; index < size ; index++)
  {
	LCD_WriteRAM(*bitmap_ptr++);
  }
  LCD_WriteReg(LCD_REG_17, 0x6028);
  LCD_SetDisplayWindow(0, 0, 239, 319);
}*/

/**
 * @brief Display image in RGB565 format 16 bit
 * @param
 */
void LCD_WriteBMP_16(uint16_t Xpos, uint16_t Ypos, uint16_t Height, uint16_t Width, uint16_t *bitmap)
{
  volatile uint32_t index;
  uint16_t *bitmap_ptr = (uint16_t *)bitmap;
  uint32_t size = (Height * Width);

  //LCD_SetDisplayWindow(Xpos, Ypos, Height, Width);	// LANDSCAPE ORIENTATION
  //LCD_WriteReg(LCD_REG_17, 0x6048);					// AM=0; ID[1:0]=11

  LCD_SetPORightUp_Win(Xpos, Ypos, Height, Width);		// PORTRAIT ORIENTATION
  LCD_WriteReg(LCD_REG_17, 0x6810);						// AM=0; ID[1:0]=01

  LCD_WriteRAM_Prepare();

  //if(BMP_FormatData == BMP_FORMAT_LE) {
      for(index = 0; index < size ; index++) {
    	  LCD_WriteRAM( *bitmap_ptr++ );
	}
  /*}
  else
    for(index = 0; index < size ; index++) {
    	LCD_WriteRAM( _bytes_change(*bitmap_ptr++) );
    }*/

  LCD_WriteReg(LCD_REG_17, 0x6030);
  LCD_SetDisplayWindow(0, 0, 239, 319);
}

/* 8x8=8 12x12=12 8x16=16 12x14=14 16x24=24 */
void LCD_PutValue(const char *msg, uint16_t val, uint16_t x, uint16_t y)
{
	char buff[10];
	uint8_t i;
	char *p = (char*)msg;
	for(i=0; *p++ ;i++) {;}

	LCD_PutString(/*10*/x, y/*currLinePos()*/, msg);
	itoa_m(val, buff);
	LCD_PutString(/*10*/x + 8*i, y/*currLinePos()*/, &buff[0]);
}

uint16_t currLinePos(void)
{
	return Y_text;
}

uint16_t nextLinePos(void)
{
	Y_text+=LCD_GetCharSize();
	if(Y_text > 319) {
		LCD_Clear(BackColor);
		resetLinePos();
	}
	return Y_text;
}

