triggery/STM32F4_GIF/LCD/SSD1289.c
uint16_t resetLinePos(void)
{
	Y_text = Y_offset;
	return Y_text;
}

/*	PORTRAIT ORIENTATION
 *	Функция установки окна для вывода Bitmap изображения
 *	в ландшафтной ориентации
 *	Прорисовка слева-направо, снизу-вверх
 */
void LCD_SetPORightUp_Win(uint16_t Xpos, uint16_t Ypos, uint16_t Height, uint16_t Width)
{
  LCD_WriteReg(0x0044, ((Xpos + Height-1)<<8) | Xpos);		// HEA[7:0] | HSA[7:0]
  LCD_WriteReg(0x0045, (Ypos - Width+1));					// vertical start pos
  LCD_WriteReg(0x0046, Ypos);								// vertical end pos
  // set cursor position
  LCD_WriteReg(0x004E, Xpos);
  LCD_WriteReg(0x004F, Ypos);
}

/*	PORTRAIT ORIENTATION
 *	Функция установки окна для вывода Bitmap изображения
 *	в ландшафтной ориентации
 *	Прорисовка слева-направо, сверху-вниз
 */
void LCD_SetPORightDown_Win(uint16_t Xpos, uint16_t Ypos, uint16_t Height, uint16_t Width)
{
  LCD_WriteReg(0x0044, ((Xpos + Width-1)<<8) | Xpos);		// HEA[7:0] | HSA[7:0]
  LCD_WriteReg(0x0045, Ypos);								// vertical start pos
  LCD_WriteReg(0x0046, Ypos + Height-1);					// vertical end pos
  // set cursor position
  LCD_WriteReg(0x004E, Xpos);
  LCD_WriteReg(0x004F, Ypos);
}

/*	LANDSCAPE ORIENTATION
 *	Функция установки полноэкранного режима для
 *	вывода Bitmap изображения в ландшафтной ориентации
 *	Прорисовка слева-направо, сверху-вниз
 */
void LCD_SetLORightDown_Win(uint16_t Xpos, uint16_t Ypos, uint16_t Height, uint16_t Width)
{
  if(Xpos >= Height)
  {
    LCD_WriteReg(0x0044, (Xpos - Height +1));
  }
  else
  {
    LCD_WriteReg(0x0044, 0x0000);
  }
  if(Ypos >= Width)
  {
    LCD_WriteReg(0x0045, (Ypos - Width +1));
  }
  else
  {
    LCD_WriteReg(0x0045, 0x0000);
  }
  LCD_WriteReg(0x0046, Ypos);
  LCD_SetCursor(Xpos, Ypos);
}

/*	PORTRAIT ORIENTATION
 *	Рисует прямоугольник в портретной ориентации
 */
void LCD_DrawFullRectFast(uint16_t Xpos, uint16_t Ypos, uint16_t Height, uint16_t Width, uint16_t color)
{
  volatile uint32_t index;
  uint32_t size = (Height * Width);

  LCD_SetPORightDown_Win(Xpos, Ypos, Height, Width);	// PORTRAIT ORIENTATION
  LCD_WriteReg(LCD_REG_17, 0x6830);						// AM=0; ID[1:0]=11

  LCD_WriteRAM_Prepare();

  for(index = 0; index < size ; index++) {
      LCD_WriteRAM( color );
  }

  LCD_WriteReg(LCD_REG_17, 0x6030);
  LCD_SetDisplayWindow(0, 0, 239, 319);
}

uint16_t tmpColorBack;
uint16_t tmpColorText;
void tempSetTextColor(uint16_t color)
{
	LCD_GetColors(&tmpColorText, &tmpColorBack);
	LCD_SetTextColor(color);
}

void tempRestoreTextColor(void)
{
	LCD_SetColors(tmpColorText, tmpColorBack);
}

void putErrorString( const char* error )
{
	tempSetTextColor(RED);
	LCD_PutString( 2, nextLinePos(), error );
	tempRestoreTextColor();
}

void setFullScreenWin(void)
{
	  //------------------------------------------
	  LCD_WriteReg(0x0044,0xEF00); // Horizontal RAM address position (R44h) (POR = EF00h)
	  LCD_WriteReg(0x0045,0x0000); // Vertical RAM address position (R45h) : start positions of the window address
	  LCD_WriteReg(0x0046,0x013F);
	  LCD_WriteReg(0x004f,0x0000);
	  LCD_WriteReg(0x004e,0x0000);
	  //------------------------------------------
}

void LCD_FullColor(uint16_t Color)
{
  uint32_t index = 0;
  LCD_SetCursor(0x00, 0x00);
  LCD_WriteRAM_Prepare();
  for(index = 0; index <76800; index++)
  {
    LCD_RAM = Color;
  }
}
